def count_substring_occurrences(main_string, sub_string):
    """
    Задача: вернуть количество вхождений sub_string в main_string.
    Поиск нечувствителен к регистру.
    """
    # TODO: напишите свой код здесь
    pass

if __name__ "__main__":
    # Примеры для самопроверки
    print(count_substring_occurrences("Hello World", "hello"))  # ожидается 1
    print(count_substring_occurrences("ababa", "aba"))          # ожидается 2